FarFine/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    Side
    {
        type            empty;
        nFaces          164934;
        startFace       164320;
    }
    Inlet
    {
        type            patch;
        nFaces          371;
        startFace       329254;
    }
    Wing
    {
        type            wall;
        nFaces          297;
        startFace       329625;
    }
    Outlet
    {
        type            patch;
        nFaces          238;
        startFace       329922;
    }
    Ground
    {
        type            wall;
        nFaces          322;
        startFace       330160;
    }
)

// ************************************************************************* //
